package main.java.com.epam.training.classes.mainTask;

public class UserCreator {

    protected void createUser(Shop shop) {

    shop.addCustomer(new Customer("Алексей","Осипов","Ярославович","Минск",
                     5096_8564_0137_2312L,3135_1234_0010_123_0933L));
    shop.addCustomer(new Customer("Даниил","Глухов","Иванович","Гомель",
                     5473_3558_5576_5884L,3135_3210_0010_456_4553L));
    shop.addCustomer(new Customer("Владислав","Сорокин","Фёдорович","Брест",
                     5933_6436_0127_0745L,3135_4564_0010_789_7863L));
    shop.addCustomer(new Customer("Иван","Широков","Викторович","Гродно",
                     5316_0532_6161_3019L,3135_6544_0010_741_0563L));
    shop.addCustomer(new Customer("Михаил","Соколов","Давидович","Могилев",
                     5888_8375_0119_5813L,3135_9787_0010_852_4533L));
    shop.addCustomer(new Customer("Дарья","Никифорова","Богдановна","Витебск",
                     5733_8683_5956_2074L,3135_7897_0010_963_0351L));
    shop.addCustomer(new Customer("Марина","Козлова","Данииловна","Борисов",
                     5734_8143_5038_1477L,3135_8528_0010_159_5683L));
    shop.addCustomer(new Customer("Ксения","Зайцева","Дмитриевна","Жодино",
                     5565_5381_7709_4906L,3135_7418_0010_753_3215L));
    shop.addCustomer(new Customer("Варвара","Александрова","Алиева","Смолевичи",
                     5366_6696_3013_2818L,3135_9639_0010_951_4983L));
    shop.addCustomer(new Customer("Анастасия","Михайлова","Ивановна","Минск",
                     5802_5048_4511_5112L,3135_7417_0010_357_9363L));
    }
}